/*?	问题描述：
某部队在某地驻扎了10个营帐，编号分别为1,2,3,4,5,6,7,8,9,10, 每个营帐最初有若干战
士。不打仗时, 每天由于训练导致的非战斗减员为1%；打仗时，每天的战斗减员为10% 
（减员人数四舍五入凑整，如减员1.4人为实际减员1人，减员1.5人为实际减员2人）。当营
帐中的战士减员到50人以内，则由上级部队调派200新兵补充。现在部队需要知道军中士兵的
分布情况，会隔若干天就派人去巡视各营帐，然后出报表呈给司令员过目。请你编写程序来做
这件事吧！
?	输入描述：
多组输入。每组输入天数，按营帐编号顺序输入战士数, 天数对应的0,1序列（0表示当天不
战斗，1表示当天战斗）。详细格式见样本输入。
?	输出描述：
对应输入数据，给出巡视那天的战士排序报表，按格式“营帐号:人数”降序给出，不同营帐人数
相同时按营帐号升序（从小到大）给出。具体格式参考样本输出。
?	样本输入：
26
100 200 300 400 500 600 700 800 900 1000
1 1 1 1 0 0 0 1 1 0 0 1 0 1 0 1 0 1 1 1 1 1 1 1 1 1
3
55 67 123 87 50 76 60 90 421 303
0 1 1
?	样本输出：
3:220 2:146 10:139 9:125 8:110 7:97 6:84 1:68 5:68 4:55
9:337 7:248 10:243 1:224 5:202 3:99 8:72 4:69 6:60 2:53
*/
#include<bits/stdc++.h>
using namespace std;
int numafterday(int,int);
int main(){
    int a[10]={},b[100]={},c[10]={},i,j,k,d,temp;
    while(cin>>d)
    {
        for(i=0;i<10;i++)
        cin>>a[i];
        for(i=0;i<d;i++)
        cin>>b[i];
        //数据读取完毕
        for(i=0;i<10;i++)
        c[i]=i;
        //计算减员的情况
        for(i=0;i<d;i++)
        {
            for(j=0;j<10;j++)
            {
                a[j]=numafterday(a[j],b[i]);
                if(a[j]<50)a[j]+=200;
            }
        }
        //排序采用选择排序,选出最大的并输出
        for(i=0;i<10;i++) 
        {
            for(j=i;j<10;j++) 
            {
                if(a[i]<a[j])
                {
                    temp=a[i];
                    a[i]=a[j];
                    a[j]=temp;
                    temp=c[i];
                    c[i]=c[j];
                    c[j]=temp;
                }
            }
        }
        for(i=0;i<10;i++)
        cout<<c[i]+1<<":"<<a[i]<<' ';
        cout<<endl;
    }
        return 0;
}
int numafterday(int x,int y){
    if(y==1)
    x=x-int(round(x*0.1));
    else
    x=x-int(round(x*0.01));
    return x;
}

